tglang/lvgl_learn/.pack/Geehy/APM32E1xx_DFP.1.0.4/Geehy.APM32E1xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Geehy</vendor>
    <name>APM32E1xx_DFP</name>
    <description>Geehy Semiconductor APM32E1 Series Device Support, Drivers and Examples</description>
    <url>https://global.geehy.com/uploads/tool/</url>
    <supportContact>https://global.geehy.com/design/software</supportContact>
    <releases>
        <release version="1.0.4" date="2025-09-12">Fixed some bugs.</release>
        <release version="1.0.3" date="2025-06-10">Update Library to 1.0.3.</release>
        <release version="1.0.2" date="2022-12-31">Update Library to 1.0.2.</release>
        <release version="1.0.1" date="2022-07-29">Update version of APM32E1 Device Family Pack.</release>
        <release version="1.0.0" date="2021-07-26">First Release version of APM32E1 Device Family Pack.</release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32E1</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32E1 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M3" DcoreVersion="r1p1" />
            <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide" />
            <description>
                Geehy Semiconductor' APM32E1 series of mainstream MCUs are 32-bit microprocessors
                based on ARM Cortex'-M3 core, with a maximum operating frequency of 120MHz. Built-in
                AHB high-performance bus, combined with high-speed memory and DMA, can achieve rapid
                data processing and storage. Built-in APB advanced peripheral bus extends the rich
                peripherals and enhanced I/O, guarantees the rapidity of connection and flexibility
                of control. The chip is equipped with powerful FPU floating-point processing unit,
                which supports single-precision data processing instructions and data types.
            </description>
            <!-- ************************  Subfamily 'APM32E103'  **************************** -->
            <subFamily DsubFamily="APM32E103">
                <feature type="WDT" n="2" />
                <feature type="RTC" n="32768" />
                <feature type="VCC" n="2.00" m="3.60" />
                <feature type="Temp" n="-40" m="105" />
                <feature type="DAC" n="2" m="12" />
                <feature type="SPI" n="3" m="18000000" />
                <feature type="I2S" n="2" />
                <feature type="I2C" n="2" />
                <feature type="USBD" n="1" />
                <feature type="CAN" n="2" />
                <!-- *************************  Device 'APM32E103CC'  ***************************** -->
                <device Dname="APM32E103CC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00040000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="7" m="16" />
                    <feature type="ADC" n="10" m="12" />
                    <feature type="IOs" n="37" />
                    <feature type="USART" n="3" m="4500000" />
                </device>
                <!-- *************************  Device 'APM32E103CE'  ***************************** -->
                <device Dname="APM32E103CE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00080000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="7" m="16" />
                    <feature type="ADC" n="10" m="12" />
                    <feature type="IOs" n="37" />
                    <feature type="USART" n="3" m="4500000" />
                </device>
                <!-- *************************  Device 'APM32E103RC'  ***************************** -->
                <device Dname="APM32E103RC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00040000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="8" m="16" />
                    <feature type="ADC" n="16" m="12" />
                    <feature type="IOs" n="51" />
                    <feature type="USART" n="3" m="4500000" />
                    <feature type="UART" n="2" m="4500000" />
                    <feature type="SDIO" n="1" />
                </device>
                <!-- *************************  Device 'APM32E103RE'  ***************************** -->
                <device Dname="APM32E103RE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00080000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="8" m="16" />
                    <feature type="ADC" n="16" m="12" />
                    <feature type="IOs" n="51" />
                    <feature type="USART" n="3" m="4500000" />
                    <feature type="UART" n="2" m="4500000" />
                    <feature type="SDIO" n="1" />
                </device>
                <!-- *************************  Device 'APM32E103VC'  ***************************** -->
                <device Dname="APM32E103VC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00040000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="8" m="16" />
                    <feature type="ADC" n="16" m="12" />
                    <feature type="IOs" n="80" />
                    <feature type="USART" n="3" m="4500000" />
                    <feature type="UART" n="2" m="4500000" />
                    <feature type="SDIO" n="1" />
                </device>
                <!-- *************************  Device 'APM32E103VE'  ***************************** -->
                <device Dname="APM32E103VE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00080000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="8" m="16" />
                    <feature type="ADC" n="16" m="12" />
                    <feature type="IOs" n="80" />
                    <feature type="USART" n="3" m="4500000" />
                    <feature type="UART" n="2" m="4500000" />
                    <feature type="SDIO" n="1" />
                </device>
                <!-- *************************  Device 'APM32E103ZC'  ***************************** -->
                <device Dname="APM32E103ZC">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00040000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00010000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00040000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="8" m="16" />
                    <feature type="ADC" n="21" m="12" />
                    <feature type="IOs" n="112" />
                    <feature type="USART" n="3" m="4500000" />
                    <feature type="UART" n="2" m="4500000" />
                    <feature type="SDIO" n="1" />
                </device>
                <!-- *************************  Device 'APM32E103ZE'  ***************************** -->
                <device Dname="APM32E103ZE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000" />
                    <compile header="Device/Include/apm32e10x.h" define="APM32E10X_HD" />
                    <debug svd="SVD/APM32E103xx.svd" />
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1" />
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1" />
                    <algorithm name="Flash/APM32E10x_512.FLM" start="0x08000000" size="0x00080000" default="1" />
                    <book name="Documents/DATASHEET.pdf" title="APM32E103 Data Sheet" />
                    <feature type="Timer" n="8" m="16" />
                    <feature type="ADC" n="21" m="12" />
                    <feature type="IOs" n="112" />
                    <feature type="USART" n="3" m="4500000" />
                    <feature type="UART" n="2" m="4500000" />
                    <feature type="SDIO" n="1" />
                </device>
            </subFamily>
        </family>
    </devices>
    <conditions>
        <!-- conditions selecting Compiler -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC" />
        </condition>
        <condition id="APM32E1xx">
            <description>Geehy Semiconductor APM32E1xx Device</description>
            <require Dvendor="Geehy:163" Dname="APM32E1*" />
        </condition>
        <condition id="APM32E1xx HD">
            <description>Geehy Semiconductor APM32E1xx High Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32E10[123]?[CDE]" />
        </condition>
