tglang/lvgl_learn/.pack/Geehy/APM32E1xx_DFP.1.0.4/Geehy.APM32E1xx_DFP.pdsc
        <condition id="APM32E1xx HD ARMCC">
            <description>filter for APM32E1xx High Density Device and the ARM compiler</description>
            <require condition="APM32E1xx HD" />
            <require Tcompiler="ARMCC" />
        </condition>
        <condition id="APM32E1xx CMSIS">
            <description>Geehy Semiconductor APM32E1xx Device with CMSIS</description>
            <require condition="APM32E1xx" />
            <require Cclass="CMSIS" Cgroup="CORE" />
        </condition>
        <condition id="APM32E1xx STDPERIPH">
            <description>Geehy Semiconductor APM32E1xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32E1xx CMSIS" />
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" />
        </condition>
        <condition id="APM32E1xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32E1xx with Standard Peripherals Drivers Framework                and RCM</description>
            <require condition="APM32E1xx CMSIS" />
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" />
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" />
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="APM32E1xx CMSIS">
            <description>System Startup for Geehy Semiconductor APM32E1xx device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/Include/" />
                <!-- startup files -->
                <file category="source" name="Device/Source/arm/startup_apm32e10x_hd.s" attr="config" version="1.0.0" condition="APM32E1xx HD ARMCC" />
                <!-- system file -->
                <file category="source" name="Device/Source/system_apm32e10x.c" attr="config" version="1.0.2" />
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/StdPeriph_Driver/inc/" />
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_misc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_misc.c" />
                <file category="header" name="Device/StdPeriph_Driver/templates/apm32e10x_it.h" attr="template" select="Interrupt Service Routines" />
                <file category="source" name="Device/StdPeriph_Driver/templates/apm32e10x_it.c" attr="template" select="Interrupt Service Routines" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_adc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_adc.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BAKPR" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>Backup registers (BAKPR) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_BAKR </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_bakpr.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_bakpr.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_can.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_can.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH ">
            <description>CRC calculation unit (CRC) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_crc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_crc.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_dma.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_dma.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_eint.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_eint.c" />
            </files>
        </component>
