tglang/lvgl_learn/.pack/Geehy/APM32E1xx_DFP.1.0.4/Geehy.APM32E1xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>Flash memory controller driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_fmc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_fmc.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_gpio.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_gpio.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_i2c.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_i2c.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SCI2C" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>SC Inter-integrated circuit (SCI2C) interface driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SCI2C </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_sci2c.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_sci2c.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.2" condition="APM32E1xx STDPERIPH ">
            <description>Independent watchdog (IWDT) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_iwdt.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_iwdt.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_pmu.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_pmu.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_rcm.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_rcm.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_spi.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_spi.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_tmr.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_tmr.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for                APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_usart.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_usart.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_wwdt.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_wwdt.c" />
            </files>
        </component>
