tglang/lvgl_learn/.pack/Geehy/APM32E1xx_DFP.1.0.4/Geehy.APM32E1xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SMC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>SMC driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_smc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_smc.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>SDRC driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_dmc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_dmc.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_dac.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_dac.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_dbgmcu.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_dbgmcu.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.2" condition="APM32E1xx STDPERIPH RCM">
            <description>Secure digital (SDIO) interface driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_sdio.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_sdio.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_rtc.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_rtc.c" />
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USB" Cversion="1.0.2" condition="APM32E1xx STDPERIPH">
            <description>USB driver for APM32E103</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriph_Driver/inc/apm32e10x_usb.h" />
                <file category="source" name="Device/StdPeriph_Driver/src/apm32e10x_usb.c" />
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32E103MINI" revision="Ver 1.1">
            <description>Geehy APM32E103 Development Board</description>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32E103ZE" />
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32E103" />
            <feature type="XTAL" n="8000000" />
            <feature type="PWR" n="5" name="USB Powered" />
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device" />
            <feature type="RS232" n="1" />
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2" />
            <feature type="LED" n="2" name="LEDs directly connected to port pins" />
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)" />
        </board>
    </boards>
    <examples>
        <example name="APM32E103MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32E103MINI/Blinky">
            <description>APM32E103_MINI Blinky example</description>
            <board name="APM32E103MINI" vendor="Geehy" />
            <project>
                <environment name="uv" load="APM32E103MINI-Blinky.uvprojx" />
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE" />
                <component Cclass="Device" Cgroup="Startup" />
                <component Cclass="CMSIS" Cgroup="RTOS" />
                <category>Getting Started</category>
                <category>CMSIS-RTX</category>
                <keyword>LED</keyword>
                <keyword>APM32E103</keyword>
            </attributes>
        </example>
    </examples>
</package>
